#include <iostream>
using namespace std;
//3.* Написать программу, которая заменяет 
//все символы точки «.» в строке, 
//введенной пользователем, на символы восклицательного знака «!».
void main() {
	char str[100];
	cin >> str;
	cout << str<<endl;
	for (int i = 0; str[i] != '\0'; i++) {
		if (str[i] == '.') {
			str[i] = '!';
		}
	}
	cout << str << endl;
}